---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs
source: html/92846ad4-4c5e-bfd8-6f02-aa2e80f2b4ef.htm
---
# MessageBoxShowingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.